#####################################################################
#信川研ESNプロジェクト用
#制作者：中村亮介 吉原悠斗 吉田聡太 飯沼貴大
#作成日：2023/05/24
#####################################################################

#====================================================================
#＜このプログラムのTodoメモ＞
#・
#・
#・

#====================================================================
import numpy as np
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns

import FileAndDir

#====================================================================
#作図出力

#********************************************************************
#継承元
class Output:
    """
    作図出力クラス
    全ての作図出力はこれを継承．
    親オブジェクトはプロジェクトもしくは評価．
    実験結果をresult_paramで受け出力．
    """
    #コンストラクタ
    def __init__(self, param: dict, parent: any):
        self.Param = param
        
        self.Parent = parent                            #親オブジェクト
        
    #本体
    def __call__(self, result_param): pass
     