#####################################################################
#ESNプロジェクト，グラフ描写用
#制作者：田中勝規
#作成日：2024/09/24
#####################################################################

"""大きな区切り"""
#====================================================================

"""中くらいの区切り"""
#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

"""小さな区切り"""
#--------------------------------------------------------------------


#====================================================================
#外部ライブラリ
#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#内部プログラム
import Project_Graph

#====================================================================
#＜このプログラムのTodoメモ＞
#・Debug用（一括実行）のプログラムが実行できていない。個々のプログラムが完成次第、取り入れる。

#・Nullclineの描写、プログラムコードが汚いので、うまい具合に描写、プログラムコードを整理する。

#・相平面、Nullclineの3Dを作成する
#・単一ニューロンではなく、複数ニューロンでネットワークを形成したときの、挙動を示すプログラムの作成
#（Sishu論文のヒートマップや、相平面を複数ニューロンで描写

#・一目見て理解できそうな名前にする
#====================================================================

#メイン
#+++合図+++
print("###Program has started.###\n")

#+++実行+++
print("###Main Program has started###\n")

#---試行---
#====================================================================
#Project_Graph.Project_Chialvo_All_2024_09_24_14_17()

#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
Project_Graph.Project_Chialvo_TimeLine_2024_09_24_17_25()
Project_Graph.Project_Chialvo_PhaseSpace_2024_09_26_12_34()

#Project_Graph.Project_Chialvo_OldNullcline_2024_09_27_15_07()
#Project_Graph.Project_Chialvo_NewNullcline_2024_10_14_18_17()
#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++



#====================================================================