#####################################################################
#ESNプロジェクト，グラフ描写用
#制作者：田中勝規
#作成日：2024/09/24
#####################################################################

"""大きな区切り"""
#====================================================================

"""中くらいの区切り"""
#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

"""小さな区切り"""
#--------------------------------------------------------------------


#====================================================================
#外部ライブラリ


#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#内部プログラム
import Project_Graph


#====================================================================
#＜このプログラムのTodoメモ＞
#・現状、Debug用のプログラムが実行できていないため、個々のプログラムが完成次第、取り掛かる
#・プロット図を個々に保存するために、実行時の時刻でフォルダを作成するプログラムの導入中
#・（上はTimeLineで完成している。）

#・実行時の時刻でフォルダを作成するプログラムは、「TimeLine」「PhaseSpace」「OldNullcline」で実装済み
#・Nullclineの描写、プログラムコードが汚いので、うまい具合に描写、プログラムコードを整理する。
#・大、中、小の区切りを全体のプログラムに適用する


#・相平面、Nullclineの3Dを作成する
#====================================================================

#メイン
#+++合図+++
print("###Program has started.###\n")

#+++実行+++
print("###Main Program has started###\n")

#---試行---
#====================================================================
#Project_Graph.Project_Chialvo_Debug_2024_09_24_14_17()

#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#Project_Graph.Project_Chialvo_TimeLine_2024_09_24_14_17()
Project_Graph.Project_Chialvo_PhaseSpace_2024_09_24_14_17()
#Project_Graph.Project_Chialvo_OldNullcline_2024_09_24_14_17()
#Project_Graph.Project_Chialvo_NewNullcline_2024_09_24_14_17()

#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


#====================================================================